using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lab_Tumakov
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Написать программу, которая спрашивает имя 
            // пользователя, и затем приветствует пользователя по имени. (Создать
            // консольное приложение.)  
            // • Откомпилировать и запустить программу с помощью Visual Studio. 
            // • Откомпилировать и запустить программу с командной строки.
            // • В среде Visual Studio использовать пошаговую отладку.Посмотреть, как
            // изменяется текущее значение переменной.
            Console.Write("1 задание");
            Console.Write("Введите ваше имя: ");
            string name = Console.ReadLine();
            Console.WriteLine($"Привет, {name}!");
            Console.WriteLine("Нажмите любую клавишу для выхода...");
            Console.ReadKey();
            // Написать программу, которой на вход подается два 
            // целых числа, на выходе – результат деления одного числа на другое. 
            // целых числа, на выходе – результат деления одного числа на другое. 
            // Предусмотреть обработку исключительной ситуации, возникающей при
            // делении числа на ноль.
            Console.Write("2 задание не сделано");
            Console.Write("3 задание не сделано");
            Console.Write("4 задание не сделано");
        }
    }
}
